Continued from previous comment.
<details><summary>Show Output</summary>

```diff
ing_connection_id = (known after apply)

      + accepter {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }

      + requester {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }
    }

  # module.peering-accepter_eu-west-3_us-west-1.aws_route.peer[0] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.160.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-accepter_eu-west-3_us-west-1.aws_route.peer[1] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.160.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-accepter_eu-west-3_us-west-1.aws_route.peer[2] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.160.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-accepter_eu-west-3_us-west-1.aws_vpc_peering_connection_accepter.peer will be created
  + resource "aws_vpc_peering_connection_accepter" "peer" {
      + accept_status             = (known after apply)
      + auto_accept               = true
      + id                        = (known after apply)
      + peer_owner_id             = (known after apply)
      + peer_region               = (known after apply)
      + peer_vpc_id               = (known after apply)
      + vpc_id                    = (known after apply)
      + vpc_peering_connection_id = (known after apply)

      + accepter {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }

      + requester {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }
    }

  # module.peering-accepter_eu-west-3_us-west-2.aws_route.peer[0] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.160.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-accepter_eu-west-3_us-west-2.aws_route.peer[1] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.160.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-accepter_eu-west-3_us-west-2.aws_route.peer[2] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.160.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-accepter_eu-west-3_us-west-2.aws_route.peer[3] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.160.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-accepter_eu-west-3_us-west-2.aws_route.peer[4] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.160.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-accepter_eu-west-3_us-west-2.aws_vpc_peering_connection_accepter.peer will be created
  + resource "aws_vpc_peering_connection_accepter" "peer" {
      + accept_status             = (known after apply)
      + auto_accept               = true
      + id                        = (known after apply)
      + peer_owner_id             = (known after apply)
      + peer_region               = (known after apply)
      + peer_vpc_id               = (known after apply)
      + vpc_id                    = (known after apply)
      + vpc_peering_connection_id = (known after apply)

      + accepter {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }

      + requester {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }
    }

  # module.peering-accepter_sa-east-1_us-east-1.aws_route.peer[0] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.208.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-accepter_sa-east-1_us-east-1.aws_route.peer[1] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.208.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-accepter_sa-east-1_us-east-1.aws_route.peer[2] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.208.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-accepter_sa-east-1_us-east-1.aws_route.peer[3] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.208.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-accepter_sa-east-1_us-east-1.aws_route.peer[4] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.208.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-accepter_sa-east-1_us-east-1.aws_route.peer[5] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.208.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-accepter_sa-east-1_us-east-1.aws_route.peer[6] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.208.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-accepter_sa-east-1_us-east-1.aws_vpc_peering_connection_accepter.peer will be created
  + resource "aws_vpc_peering_connection_accepter" "peer" {
      + accept_status             = (known after apply)
      + auto_accept               = true
      + id                        = (known after apply)
      + peer_owner_id             = (known after apply)
      + peer_region               = (known after apply)
      + peer_vpc_id               = (known after apply)
      + vpc_id                    = (known after apply)
      + vpc_peering_connection_id = (known after apply)

      + accepter {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }

      + requester {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }
    }

  # module.peering-accepter_sa-east-1_us-east-2.aws_route.peer[0] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.208.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-accepter_sa-east-1_us-east-2.aws_route.peer[1] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.208.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-accepter_sa-east-1_us-east-2.aws_route.peer[2] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.208.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-accepter_sa-east-1_us-east-2.aws_route.peer[3] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.208.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-accepter_sa-east-1_us-east-2.aws_vpc_peering_connection_accepter.peer will be created
  + resource "aws_vpc_peering_connection_accepter" "peer" {
      + accept_status             = (known after apply)
      + auto_accept               = true
      + id                        = (known after apply)
      + peer_owner_id             = (known after apply)
      + peer_region               = (known after apply)
      + peer_vpc_id               = (known after apply)
      + vpc_id                    = (known after apply)
      + vpc_peering_connection_id = (known after apply)

      + accepter {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }

      + requester {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }
    }

  # module.peering-accepter_sa-east-1_us-west-1.aws_route.peer[0] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.208.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-accepter_sa-east-1_us-west-1.aws_route.peer[1] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.208.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-accepter_sa-east-1_us-west-1.aws_route.peer[2] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.208.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-accepter_sa-east-1_us-west-1.aws_vpc_peering_connection_accepter.peer will be created
  + resource "aws_vpc_peering_connection_accepter" "peer" {
      + accept_status             = (known after apply)
      + auto_accept               = true
      + id                        = (known after apply)
      + peer_owner_id             = (known after apply)
      + peer_region               = (known after apply)
      + peer_vpc_id               = (known after apply)
      + vpc_id                    = (known after apply)
      + vpc_peering_connection_id = (known after apply)

      + accepter {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }

      + requester {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }
    }

  # module.peering-accepter_sa-east-1_us-west-2.aws_route.peer[0] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.208.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-accepter_sa-east-1_us-west-2.aws_route.peer[1] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.208.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-accepter_sa-east-1_us-west-2.aws_route.peer[2] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.208.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-accepter_sa-east-1_us-west-2.aws_route.peer[3] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.208.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-accepter_sa-east-1_us-west-2.aws_route.peer[4] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.208.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-accepter_sa-east-1_us-west-2.aws_vpc_peering_connection_accepter.peer will be created
  + resource "aws_vpc_peering_connection_accepter" "peer" {
      + accept_status             = (known after apply)
      + auto_accept               = true
      + id                        = (known after apply)
      + peer_owner_id             = (known after apply)
      + peer_region               = (known after apply)
      + peer_vpc_id               = (known after apply)
      + vpc_id                    = (known after apply)
      + vpc_peering_connection_id = (known after apply)

      + accepter {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }

      + requester {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }
    }

  # module.peering-accepter_us-east-1_us-east-2.aws_route.peer[0] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.0.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-accepter_us-east-1_us-east-2.aws_route.peer[1] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.0.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-accepter_us-east-1_us-east-2.aws_route.peer[2] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.0.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-accepter_us-east-1_us-east-2.aws_route.peer[3] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.0.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-accepter_us-east-1_us-east-2.aws_vpc_peering_connection_accepter.peer will be created
  + resource "aws_vpc_peering_connection_accepter" "peer" {
      + accept_status             = (known after apply)
      + auto_accept               = true
      + id                        = (known after apply)
      + peer_owner_id             = (known after apply)
      + peer_region               = (known after apply)
      + peer_vpc_id               = (known after apply)
      + vpc_id                    = (known after apply)
      + vpc_peering_connection_id = (known after apply)

      + accepter {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }

      + requester {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }
    }

  # module.peering-accepter_us-east-1_us-west-1.aws_route.peer[0] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.0.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-accepter_us-east-1_us-west-1.aws_route.peer[1] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.0.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-accepter_us-east-1_us-west-1.aws_route.peer[2] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.0.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-accepter_us-east-1_us-west-1.aws_vpc_peering_connection_accepter.peer will be created
  + resource "aws_vpc_peering_connection_accepter" "peer" {
      + accept_status             = (known after apply)
      + auto_accept               = true
      + id                        = (known after apply)
      + peer_owner_id             = (known after apply)
      + peer_region               = (known after apply)
      + peer_vpc_id               = (known after apply)
      + vpc_id                    = (known after apply)
      + vpc_peering_connection_id = (known after apply)

      + accepter {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }

      + requester {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }
    }

  # module.peering-accepter_us-east-1_us-west-2.aws_route.peer[0] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.0.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-accepter_us-east-1_us-west-2.aws_route.peer[1] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.0.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-accepter_us-east-1_us-west-2.aws_route.peer[2] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.0.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-accepter_us-east-1_us-west-2.aws_route.peer[3] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.0.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-accepter_us-east-1_us-west-2.aws_route.peer[4] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.0.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-accepter_us-east-1_us-west-2.aws_vpc_peering_connection_accepter.peer will be created
  + resource "aws_vpc_peering_connection_accepter" "peer" {
      + accept_status             = (known after apply)
      + auto_accept               = true
      + id                        = (known after apply)
      + peer_owner_id             = (known after apply)
      + peer_region               = (known after apply)
      + peer_vpc_id               = (known after apply)
      + vpc_id                    = (known after apply)
      + vpc_peering_connection_id = (known after apply)

      + accepter {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }

      + requester {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }
    }

  # module.peering-accepter_us-east-2_us-west-1.aws_route.peer[0] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.16.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-accepter_us-east-2_us-west-1.aws_route.peer[1] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.16.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-accepter_us-east-2_us-west-1.aws_route.peer[2] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.16.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-accepter_us-east-2_us-west-1.aws_vpc_peering_connection_accepter.peer will be created
  + resource "aws_vpc_peering_connection_accepter" "peer" {
      + accept_status             = (known after apply)
      + auto_accept               = true
      + id                        = (known after apply)
      + peer_owner_id             = (known after apply)
      + peer_region               = (known after apply)
      + peer_vpc_id               = (known after apply)
      + vpc_id                    = (known after apply)
      + vpc_peering_connection_id = (known after apply)

      + accepter {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }

      + requester {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }
    }

  # module.peering-accepter_us-east-2_us-west-2.aws_route.peer[0] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.16.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-accepter_us-east-2_us-west-2.aws_route.peer[1] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.16.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-accepter_us-east-2_us-west-2.aws_route.peer[2] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.16.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-accepter_us-east-2_us-west-2.aws_route.peer[3] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.16.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-accepter_us-east-2_us-west-2.aws_route.peer[4] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.16.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-accepter_us-east-2_us-west-2.aws_vpc_peering_connection_accepter.peer will be created
  + resource "aws_vpc_peering_connection_accepter" "peer" {
      + accept_status             = (known after apply)
      + auto_accept               = true
      + id                        = (known after apply)
      + peer_owner_id             = (known after apply)
      + peer_region               = (known after apply)
      + peer_vpc_id               = (known after apply)
      + vpc_id                    = (known after apply)
      + vpc_peering_connection_id = (known after apply)

      + accepter {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }

      + requester {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }
    }

  # module.peering-accepter_us-west-1_us-west-2.aws_route.peer[0] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.32.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-accepter_us-west-1_us-west-2.aws_route.peer[1] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.32.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-accepter_us-west-1_us-west-2.aws_route.peer[2] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.32.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-accepter_us-west-1_us-west-2.aws_route.peer[3] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.32.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-accepter_us-west-1_us-west-2.aws_route.peer[4] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.32.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-accepter_us-west-1_us-west-2.aws_vpc_peering_connection_accepter.peer will be created
  + resource "aws_vpc_peering_connection_accepter" "peer" {
      + accept_status             = (known after apply)
      + auto_accept               = true
      + id                        = (known after apply)
      + peer_owner_id             = (known after apply)
      + peer_region               = (known after apply)
      + peer_vpc_id               = (known after apply)
      + vpc_id                    = (known after apply)
      + vpc_peering_connection_id = (known after apply)

      + accepter {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }

      + requester {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }
    }

  # module.peering-requester_ap-northeast-1_ap-northeast-2.aws_route.peer[0] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.80.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_ap-northeast-1_ap-northeast-2.aws_route.peer[1] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.80.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_ap-northeast-1_ap-northeast-2.aws_route.peer[2] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.80.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_ap-northeast-1_ap-northeast-2.aws_route.peer[3] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.80.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_ap-northeast-1_ap-northeast-2.aws_vpc_peering_connection.peer will be created
  + resource "aws_vpc_peering_connection" "peer" {
      + accept_status = (known after apply)
      + id            = (known after apply)
      + peer_owner_id = (known after apply)
      + peer_region   = "ap-northeast-2"
      + peer_vpc_id   = (known after apply)
      + vpc_id        = (known after apply)

      + accepter {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }

      + requester {
          + allow_classic_link_to_remote_vpc = (known after apply)
          + allow_remote_vpc_dns_resolution  = (known after apply)
          + allow_vpc_to_remote_classic_link = (known after apply)
        }
    }

  # module.peering-requester_ap-northeast-1_ap-south-1.aws_route.peer[0] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.224.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_ap-northeast-1_ap-south-1.aws_route.peer[1] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.224.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_ap-northeast-1_ap-south-1.aws_route.peer[2] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.224.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id                 = (known after apply)
      + id                         = (known after apply)
      + instance_id                = (known after apply)
      + instance_owner_id          = (known after apply)
      + nat_gateway_id             = (known after apply)
      + network_interface_id       = (known after apply)
      + origin                     = (known after apply)
      + route_table_id             = (known after apply)
      + state                      = (known after apply)
      + vpc_peering_connection_id  = (known after apply)
    }

  # module.peering-requester_ap-northeast-1_ap-south-1.aws_route.peer[3] will be created
  + resource "aws_route" "peer" {
      + destination_cidr_block     = "10.60.224.0/20"
      + destination_prefix_list_id = (known after apply)
      + egress_only_gateway_id     = (known after apply)
      + gateway_id 
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.